Importing Packages

In [1]:
import pandas as pd
import numpy as np

Load CSV Data

In [2]:
df_csv = pd.read_csv("orders.csv")
df_csv.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

Load JSON Data

In [3]:
df_json = pd.read_json("users.json", orient = "records")

Load SQL Data

In [7]:
import sqlite3
conn = sqlite3.connect("restaurant.db")
with open("restaurants.sql") as f:
    sql_script = f.read()
conn.executescript(sql_script)

In [8]:
restaurants = pd.read_sql_query("SELECT * FROM restaurants",conn)
restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

Merge the Data

In [9]:
orders_users_df = pd.merge(
    df_csv,
    df_json,
    on="user_id",
    how = "left"
)
orders_users_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular

In [10]:
final_df = pd.merge(
    orders_users_df,
    restaurants,
    on = "restaurant_id",
    how = "left"
)
final_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [11]:
final_df.shape

(10000, 12)

In [12]:
final_df.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating'],
      dtype='object')

In [13]:
final_df = final_df.drop(columns=["restaurants_name_y"],errors = "ignore")
final_df = final_df.rename(columns={"restaurants_name_x":"restaurant_name"})

In [14]:
final_df.to_csv("final_food_delivery_dataset.csv",index = False)

Final Dataset

In [15]:
import os 
os.listdir()

['.ipynb_checkpoints',
 '4499732-swiggy_(2)',
 '4499732-swiggy_(2).zip',
 'final_food_delivery_dataset.csv',
 'Hasini_innomatics.ipynb',
 'orders.csv',
 'restaurant.db',
 'restaurants.db',
 'restaurants.sql',
 'users.json']

In [16]:
pd.read_csv("final_food_delivery_dataset.csv")

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0
...,...,...,...,...,...,...,...,...,...,...,...,...
9995,9996,2528,249,21-05-2023,1211.96,Royal Kitchen North Indian,User_2528,Hyderabad,Gold,Restaurant_249,Italian,4.7
9996,9997,2867,267,06-08-2023,1188.05,Darbar Cafe Punjabi,User_2867,Bangalore,Regular,Restaurant_267,Chinese,4.2
9997,9998,522,420,11-11-2023,979.44,Ruchi Tiffins Chinese,User_522,Bangalore,Gold,Restaurant_420,Italian,4.0
9998,9999,319,492,08-09-2023,1105.93,Swagath Kitchen North Indian,User_319,Bangalore,Gold,Restaurant_492,Italian,4.0
9999,10000,457,439,21-10-2023,879.58,Classic Cafe Family Restaurant,User_457,Chennai,Regular,Restaurant_439,Mexican,3.1

1.Order trends over time

In [17]:
final_df.dtypes

order_id               int64
user_id                int64
restaurant_id          int64
order_date            object
total_amount         float64
restaurant_name_x     object
name                  object
city                  object
membership            object
restaurant_name_y     object
cuisine               object
rating               float64
dtype: object

In [18]:
final_df["order_date"] = pd.to_datetime(
    final_df["order_date"],
    format = "%d-%m-%Y"
)

In [19]:
final_df.dtypes

order_id                      int64
user_id                       int64
restaurant_id                 int64
order_date           datetime64[ns]
total_amount                float64
restaurant_name_x            object
name                         object
city                         object
membership                   object
restaurant_name_y            object
cuisine                      object
rating                      float64
dtype: object

In [20]:
orders_trend = final_df.groupby(
    final_df["order_date"].dt.to_period("M")
).size()
orders_trend

order_date
2023-01    804
2023-02    785
2023-03    903
2023-04    812
2023-05    844
2023-06    784
2023-07    859
2023-08    851
2023-09    812
2023-10    863
2023-11    807
2023-12    849
2024-01     27
Freq: M, dtype: int64

2. User Behaviour patterns

In [21]:
final_df.groupby("user_id")["order_id"].count().describe()

count    2883.000000
mean        3.468609
std         1.792682
min         1.000000
25%         2.000000
50%         3.000000
75%         4.000000
max        13.000000
Name: order_id, dtype: float64

3. City-wise and cuisine-wise performance

In [22]:
final_df.groupby("cuisine")["order_id"].count().sort_values(ascending=False)

cuisine
Mexican    2581
Italian    2532
Indian     2469
Chinese    2418
Name: order_id, dtype: int64

4. Membership impact(Gold vs Regular)

In [23]:
final_df.groupby("membership")["total_amount"].sum()

membership
Gold       3975364.89
Regular    4036259.23
Name: total_amount, dtype: float64

5.Revenue distribution and seasonality

In [24]:
final_df.groupby(
    final_df["order_date"].dt.to_period("M")
)["total_amount"].sum()

order_date
2023-01    645818.76
2023-02    630867.40
2023-03    716738.98
2023-04    666097.18
2023-05    668428.61
2023-06    610822.93
2023-07    688559.45
2023-08    694987.58
2023-09    653838.07
2023-10    699187.73
2023-11    637772.43
2023-12    681303.50
2024-01     17201.50
Freq: M, Name: total_amount, dtype: float64

1Q) Which city has the highest total revenue(total_amount)from Gold members?

In [25]:
gold_city_revenue = (
    final_df[final_df["membership"] == "Gold"]
    .groupby("city")["total_amount"]
    .sum()
    .sort_values(ascending=False)
)
gold_city_revenue

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

2Q) Which cuisine has the highest average order value across all orders?

In [26]:
cuisine_avg_order = (
    final_df.groupby("cuisine")["total_amount"]
    .mean()
    .sort_values(ascending=False)
)
cuisine_avg_order

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

3Q) How many distinct users placed orders worth more than ₹1000 in total (sum of all their orders)?

In [27]:
high_value_users = (
    final_df.groupby("user_id")["total_amount"]
    .sum()
)
count_users = (high_value_users > 1000).sum()
count_users

np.int64(2544)

4Q) Which restaurant rating range generated the highest total revenue?

In [28]:
final_df["rating_range"] = pd.cut(
    final_df["rating"],
    bins = [3.0, 3.5, 4.0, 4.5, 5.0],
    labels = ["3.0-3.5", "3.6-4.0", "4.1-4.5", "4.6-5.0"]
)

rating_revenue = (
    final_df.groupby("rating_range")["total_amount"]
    .sum()
    .sort_values(ascending=False)
)
rating_revenue

C:\Users\hasin\AppData\Local\Temp\ipykernel_18108\3687774486.py:8: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  final_df.groupby("rating_range")["total_amount"]

rating_range
4.6-5.0    2197030.75
4.1-4.5    1960326.26
3.0-3.5    1881754.57
3.6-4.0    1717494.41
Name: total_amount, dtype: float64

5Q) Among Gold members, which city has the highest average order value?

In [29]:
gold_city_avg = (
    final_df[final_df["membership"] == "Gold"]
    .groupby("city")["total_amount"]
    .mean()
    .sort_values(ascending=False)
)
gold_city_avg

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

6Q) Which cuisine has the lowest number of distinct restaurants but still contributes significant revenue?

In [30]:
restaurants_per_cuisine = (
    final_df.groupby("cuisine")["restaurant_id"]
    .nunique()
)

revenue_per_cuisine = (
    final_df.groupby("cuisine")["total_amount"]
    .sum()
)
restaurants_per_cuisine,revenue_per_cuisine

(cuisine
 Chinese    120
 Indian     126
 Italian    126
 Mexican    128
 Name: restaurant_id, dtype: int64,
 cuisine
 Chinese    1930504.65
 Indian     1971412.58
 Italian    2024203.80
 Mexican    2085503.09
 Name: total_amount, dtype: float64)

7Q) What percentage of total orders were placed by Gold members? (Rounded to nearest integer)

In [31]:
total_orders = len(final_df)
gold_orders = len(final_df[final_df["membership"] == "Gold"])
percentage = round((gold_orders / total_orders) * 100)
percentage

50

8Q) Which restaurant has the highest average order value but less than 20 total orders?

In [32]:
options = [
    "Grand Cafe Punjabi",
    "Grand Restaurant South India",
    "Ruchi Mess Multicuisine",
    "Ruchi Foods Chinese"
]
avg_ord = (
    final_df[final_df["restaurant_name_x"].isin(options)]
    .groupby("restaurant_name_x")
    .agg(
        avg_order=("total_amount", "mean"),
        order_count=("order_id", "count")
    )
    .query("order_count < 20")
    .sort_values("avg_order", ascending=False)
    .head(1)
)

avg_ord

                      avg_order  order_count
restaurant_name_x
Ruchi Foods Chinese  686.603158           19

9Q)

In [33]:
combo_revenue = (
    final_df.groupby(["membership","cuisine"])["total_amount"]
    .sum()
    .sort_values(ascending=False)
)
combo_revenue

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

10Q) During which quarter of the year is the total revenue highest?

In [34]:
final_df["quater"] = final_df["order_date"].dt.to_period("Q")
quater_revenue = (
    final_df.groupby("quater")["total_amount"]
    .sum()
    .sort_values(ascending=False)
)
quater_revenue

quater
2023Q3    2037385.10
2023Q4    2018263.66
2023Q1    1993425.14
2023Q2    1945348.72
2024Q1      17201.50
Freq: Q-DEC, Name: total_amount, dtype: float64

NUMERICAL ANSWERS

1Q) How many total orders were placed by users with Gold membership?

In [35]:
gold_total_orders = final_df[final_df["membership"] == "Gold"]["order_id"].count()
gold_total_orders

np.int64(4987)

2Q) What is the total revenue (rounded to nearest integer) generated from orders placed in Hyderabad city?

In [36]:
hyderabad_revenue = final_df[final_df["city"] == "Hyderabad"]["total_amount"].sum()
round(hyderabad_revenue)

1889367

3Q) How many distinct users placed at least one order?

In [37]:
distinct_users = final_df["user_id"].nunique()
distinct_users

2883

4Q) What is the average order value (rounded to 2 decimals) for Gold members?

In [38]:
gold_avg_order_value = (
    final_df[final_df["membership"] == "Gold"]["total_amount"].mean()
)
round(gold_avg_order_value,2)

np.float64(797.15)

5Q) How many orders were placed for restaurants with rating ≥ 4.5?

In [39]:
high_rating_orders = final_df[final_df["rating"] >= 4.5]["order_id"].count()
high_rating_orders

np.int64(3374)

6Q) How many orders were placed in the top revenue city among Gold members only?

In [40]:
top_gold_city = (
    final_df[final_df["membership"] == "Gold"]
    .groupby("city")["total_amount"]
    .sum()
    .idxmax()
)
orders_in_top_gold_city = final_df[
    (final_df["membership"] == "Gold")&
    (final_df["city"] == top_gold_city)
]["order_id"].count()
top_gold_city,orders_in_top_gold_city

('Chennai', np.int64(1337))